In [250]:
import pandas as pd
import numpy as np
from IPython.display import HTML, display
display(HTML("<style>.container { width:80% !important; }</style>"))

In [4]:
!ls

compare_tables.ipynb match_file.csv       source_data.json

# 1) Load csv

In [6]:
csv_data = pd.read_csv('match_file.csv')
print(csv_data.shape)
csv_data.head(2)

(1265, 8)

,first_name,last_name,npi,street,street_2,city,state,zip
0,Ruthe,Laverne,44843147983186317848,569 glenda islands,suite 163,willport,nj,23453
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965

In [78]:
csv_data['unique_id'] = csv_data['first_name'] +'_' + csv_data['last_name'] + '_' + csv_data['npi']

In [80]:
csv_data.shape

(1265, 9)

# 2) Load Json

In [218]:
fname_list = []
lname_list = []
npi_list = []

lat_list = []
lon_list = []
street_list = []
street_2_list = []
city_list = []
state_list = []
zip_list = []

i = 1
with open('source_data.json', 'r+') as infile:
    for line in infile:
        line = line.replace("\\", r"\\")
        line = json.loads(line)
        
        for index, elem in enumerate(line['practices']):
        
            fname_list.append(line['doctor']['first_name'])
            lname_list.append(line['doctor']['last_name'])
            npi_list.append(line['doctor']['npi'])

            lat_list.append(line['practices'][index]['lat'])
            lon_list.append(line['practices'][index]['lon'])
            street_list.append(line['practices'][index]['street'])
            street_2_list.append(line['practices'][index]['street_2'])
            city_list.append(line['practices'][index]['city'])
            state_list.append(line['practices'][index]['state'])
            zip_list.append(line['practices'][index]['zip'])
        '''
        i = i + 1
        if i > 3:
            break
        '''

In [219]:
len(fname_list), len(lname_list), len(street_list), len(street_2_list), len(city_list), \
len(state_list), len(zip_list)

(22443, 22443, 22443, 22443, 22443, 22443, 22443)

In [221]:
new_json_data = pd.DataFrame()
new_json_data['first_name'] = fname_list
new_json_data['last_name'] = lname_list
new_json_data['npi'] = npi_list

new_json_data['lat'] = lat_list
new_json_data['lon'] = lon_list
new_json_data['street'] = street_list
new_json_data['street_2'] = street_2_list
new_json_data['city'] = city_list
new_json_data['state'] = state_list
new_json_data['zip'] = zip_list

In [222]:
new_json_data.head()

,first_name,last_name,npi,lat,lon,street,street_2,city,state,zip
0,Dean,Israel,85103080143784778415,-79.8757664338564,84.31253504872467,271 Annabelle Fort,Apt. 404,Port Demetris,LA,53549
1,Quinton,Mollie,36233383542350521233,81.37417480720865,-95.33450729432164,8496 Kennedi Inlet,Suite 815,Nealville,OR,52665-6811
2,Quinton,Mollie,36233383542350521233,69.84837521604314,87.36942972635728,29483 Nader Wall,Apt. 748,Rashadborough,UT,46006-3437
3,Quinton,Mollie,36233383542350521233,84.90377842497296,177.28706015725533,2122 Wintheiser Valleys,Suite 855,South Daronland,AK,99372
4,Vincent,Abbie,68951826121607537145,52.12502086274685,109.12414094328233,210 Walsh Island,Suite 839,West Lonnieberg,GA,59104

In [224]:
new_json_data.npi.value_counts().head(3)

11881194864178761227    3
34807296185436331893    3
29272298666807261020    3
Name: npi, dtype: int64

In [227]:
new_json_data.groupby(['npi', 'first_name']).agg({'street' : 'nunique'}).head()#.sort_values(by='street', ascending = False)

                                 street
npi                  first_name
00062909005638231593 Harrison         3
00134083762165487233 Isidro           3
00137584534536575306 Ella             1
00144633524487783185 Robin            3
00145137149169747714 Domenick         2

# 3) Merge

In [229]:
csv_data.head(2)

,first_name,last_name,npi,street,street_2,city,state,zip,unique_id
0,Ruthe,Laverne,44843147983186317848,569 glenda islands,suite 163,willport,nj,23453,Ruthe_Laverne_44843147983186317848
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041

In [228]:
new_json_data.head(2)

,first_name,last_name,npi,lat,lon,street,street_2,city,state,zip
0,Dean,Israel,85103080143784778415,-79.8757664338564,84.31253504872467,271 Annabelle Fort,Apt. 404,Port Demetris,LA,53549
1,Quinton,Mollie,36233383542350521233,81.37417480720865,-95.33450729432164,8496 Kennedi Inlet,Suite 815,Nealville,OR,52665-6811

In [ ]:
#Output should have the following at a minimum
# of total documents scanned
# of Doctors matched with NPI
# of Doctors matched with name and address
# of Practices matched with NPI
# of Practice matched with address
# of documents that could not be matched

# 4) Numbers

## 1) Total Number documents scanned : csv=1265, json=22443

In [255]:
csv_data.shape, new_json_data.shape

((1265, 9), (22443, 10))

## 2) Total Doctors matched npi : 765

In [262]:
merged_df = pd.merge(csv_data, new_json_data, on=['npi'], how='inner')
print(merged_df.shape)
merged_df.head(2)

(1718, 18)

,first_name_x,last_name_x,npi,street_x,street_2_x,city_x,state_x,zip_x,unique_id,first_name_y,last_name_y,lat,lon,street_y,street_2_y,city_y,state_y,zip_y
0,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,67.8952178905721,-71.54982356539455,729 Reuben Stream,Apt. 314,Lake Sheila,AZ,85355
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,-84.7669879597025,134.0653096213187,59944 Adaline Harbor,Apt. 862,Keelingstad,AL,94189-5965

In [263]:
merged_df.first_name_x.unique().shape

(765,)

## 3) # of Doctors matched with name and address : 970

In [264]:
merged_df = pd.merge(csv_data, new_json_data, on=['first_name', 'last_name'], how='inner')
print(merged_df.shape)
merged_df.head(2)

(2264, 17)

,first_name,last_name,npi_x,street_x,street_2_x,city_x,state_x,zip_x,unique_id,npi_y,lat,lon,street_y,street_2_y,city_y,state_y,zip_y
0,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,18233577393219566041,67.8952178905721,-71.54982356539455,729 Reuben Stream,Apt. 314,Lake Sheila,AZ,85355
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,18233577393219566041,-84.7669879597025,134.0653096213187,59944 Adaline Harbor,Apt. 862,Keelingstad,AL,94189-5965

In [266]:
merged_df.first_name.unique().shape

(970,)

## 4) # of Practices matched with NPI = 1718

In [268]:
merged_df = pd.merge(csv_data, new_json_data, on=['npi'], how='inner')
print(merged_df.shape)
merged_df.head(2)

(1718, 18)

,first_name_x,last_name_x,npi,street_x,street_2_x,city_x,state_x,zip_x,unique_id,first_name_y,last_name_y,lat,lon,street_y,street_2_y,city_y,state_y,zip_y
0,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,67.8952178905721,-71.54982356539455,729 Reuben Stream,Apt. 314,Lake Sheila,AZ,85355
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,-84.7669879597025,134.0653096213187,59944 Adaline Harbor,Apt. 862,Keelingstad,AL,94189-5965

## 5) # of Practice matched with address : 0 (on uncleaned data as-is)

In [275]:
csv_data.columns

Index(['first_name', 'last_name', 'npi', 'street', 'street_2', 'city', 'state',
       'zip', 'unique_id'],
      dtype='object')

In [276]:
new_json_data.columns

Index(['first_name', 'last_name', 'npi', 'lat', 'lon', 'street', 'street_2',
       'city', 'state', 'zip'],
      dtype='object')

In [277]:
merged_df = pd.merge(csv_data, new_json_data, on=['street'], how='inner')
print(merged_df.shape)
merged_df.head(2)

(0, 18)

Empty DataFrame
Columns: [first_name_x, last_name_x, npi_x, street, street_2_x, city_x, state_x, zip_x, unique_id, first_name_y, last_name_y, npi_y, lat, lon, street_2_y, city_y, state_y, zip_y]
Index: []

## 6) # of documents that could not be matched :

## unmatched in json 401, unmatched in csv 20725

In [284]:
merged_df = pd.merge(csv_data, new_json_data, on=['npi'], how='outer')
print(merged_df.shape)
merged_df.head(2)

(22844, 18)

,first_name_x,last_name_x,npi,street_x,street_2_x,city_x,state_x,zip_x,unique_id,first_name_y,last_name_y,lat,lon,street_y,street_2_y,city_y,state_y,zip_y
0,Ruthe,Laverne,44843147983186317848,569 glenda islands,suite 163,willport,nj,23453,Ruthe_Laverne_44843147983186317848,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Marshall,Cole,18233577393219566041,59944 adaline harbor,apt. 862,keelingstad,al,94189-5965,Marshall_Cole_18233577393219566041,Marshall,Cole,67.8952178905721,-71.54982356539455,729 Reuben Stream,Apt. 314,Lake Sheila,AZ,85355

In [280]:
merged_df[merged_df.first_name_y.isnull()].shape

(401, 18)

In [285]:
merged_df[merged_df.first_name_x.isnull()].shape

(20725, 18)